load-test-report/ssd/random-io-8kb-image.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
test: Laying out IO file (1 file / 80MiB)

test: (groupid=0, jobs=1): err= 0: pid=1591: Tue Apr 15 07:41:37 2025
  read: IOPS=1264, BW=5059KiB/s (5181kB/s)(296MiB/60001msec)
    slat (usec): min=9, max=859, avg=19.14, stdev=15.32
    clat (usec): min=3, max=5923, avg=768.27, stdev=267.88
     lat (usec): min=358, max=5947, avg=787.41, stdev=268.70
    clat percentiles (usec):
     |  1.00th=[  416],  5.00th=[  482], 10.00th=[  529], 20.00th=[  562],
     | 30.00th=[  586], 40.00th=[  611], 50.00th=[  668], 60.00th=[  775],
     | 70.00th=[  873], 80.00th=[  979], 90.00th=[ 1139], 95.00th=[ 1287],
     | 99.00th=[ 1614], 99.50th=[ 1745], 99.90th=[ 2040], 99.95th=[ 2180],
     | 99.99th=[ 2507]
   bw (  KiB/s): min= 4600, max= 5648, per=100.00%, avg=5062.37, stdev=193.13, samples=119
   iops        : min= 1150, max= 1412, avg=1265.59, stdev=48.29, samples=119
  lat (usec)   : 4=0.01%, 100=0.01%, 250=0.01%, 500=6.74%, 750=50.94%
  lat (usec)   : 1000=23.88%
  lat (msec)   : 2=18.29%, 4=0.13%, 10=0.01%
  cpu          : usr=1.04%, sys=3.83%, ctx=75897, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=75889,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5059KiB/s (5181kB/s), 5059KiB/s-5059KiB/s (5181kB/s-5181kB/s), io=296MiB (311MB), run=60001-60001msec

Disk stats (read/write):
  xvda: ios=75829/8, sectors=606632/88, merge=0/3, ticks=53994/4, in_queue=53999, util=90.23%